#+title: PISM-IceBin-ModelE in a container

* The Makefile driving all this

Here's how to use this:

Either clone or symlink repositories to get this directory structure:

#+begin_src bash
find . -maxdepth 2 \( -name .git -prune \) -o -type l -o -type d
#+end_src

#+RESULTS:
| 0                              |
| ./ibmisc                       |
| ./.#notes.org                  |
| ./modele_data                  |
| ./modele_data/prod_input_files |
| ./icebin                       |
| ./.git                         |
| ./pism                         |
  
#+begin_src makefile :tangle rules.mk
IMAGE=ckhrulev/icebin-env:0.0.1

IBMISC_DIR ?= ${PWD}/ibmisc
ICEBIN_DIR ?= ${PWD}/icebin
PISM_DIR ?= ${PWD}/pism
MODELE_DIR ?= ${PWD}/modelE

MODELE_DATA_DIR ?= ${PWD}/modele_data
TOOLS_DIR ?= ${PWD}

SCRIPTS=build-all.sh build-pism.sh build-ibmisc.sh build-icebin.sh build-modele.sh run-modele.sh
GENERATED=${SCRIPTS} icebin.cdl.template rundeck.R Dockerfile

run: build scripts
	docker run \
		--rm \
		-it \
		-v ${ICEBIN_DIR}:/opt/icebin -e ICEBIN_DIR=/opt/icebin \
		-v ${IBMISC_DIR}:/opt/ibmisc -e IBMISC_DIR=/opt/ibmisc \
		-v ${PISM_DIR}:/opt/pism     -e PISM_DIR=/opt/pism \
		-v ${MODELE_DIR}:/opt/modele -e MODELE_DIR=/opt/modele \
		-v ${MODELE_DATA_DIR}:/opt/modele_data -e MODELE_DATA_DIR=/opt/modele_data \
		-v ${TOOLS_DIR}:/opt/tools   -e TOOLS_DIR=/opt/tools \
		${IMAGE} \
		bash

build: Dockerfile
	docker build -t ${IMAGE} .

scripts: ${SCRIPTS}
	chmod a+x ${SCRIPTS}

${GENERATED}: notes.org
	emacs -Q --batch -l org $^ -f org-babel-tangle

clean:
	@rm -f ${GENERATED}
	@rm -f rules.mk
#+end_src

# Note: we have to set org-src-preserve-indentation to be able to use
# a makefile code block.

# Local Variables:
# org-src-preserve-indentation: t
# End:
